[{"job": "Senior UI Artist (Remote, Canada)", "discription": "At Iron Fox Games, we believe UI is the unsung hero of our game experiences. As Senior UI Artist, you will be both a hands-on developer,  working closely with a mighty passionate team to implement as well as define the look and feel of menus and interfaces.", "link": "https://www.ironfoxgames.com/senior-ui-artist"}, {"job": "Systems Designer (Remote, Canada)", "discription": "When designing things, there is a deep underlying play between how things work, how they function and interconnectedness of fun. We're on the hunt for a designer who excels at putting these all together.", "link": "https://www.ironfoxgames.com/systems-designer"}, {"job": "Senior Mathemagician (Remote, Canada)", "discription": "Do you wake up thinking in excel formulas? Have you read white papers about bonding curves? Love balancing things that hit the right note of difficulty and fun? Then this is the job for you!", "link": "https://www.ironfoxgames.com/senior-mathemagician"}, {"job": "Associate Software Engineer\n(Remote, Canada)", "discription": "Looking for the next step in your career journey? We're looking for Associate Software Engineers to help us build some really interesting things.", "link": "https://www.ironfoxgames.com/associate-engineer"}, {"job": "Software Engineer (Remote, Canada)", "discription": "You will be joining a technical department made up of veteran developers who have seen just about everything in game development. We’re looking for someone who has a passion for building fun games and loves to solve problems!", "link": "https://www.ironfoxgames.com/software-engineer"}, {"job": "Senior Software Engineer \n(Remote, Canada)", "discription": "We are looking for someone with strong technical and leadership skills who will help us build and deliver quality games!", "link": "https://www.ironfoxgames.com/senior-software-engineer"}, {"job": "(Remote, Canada)", "discription": "We are looking for someone to work on an existing title in a production environment.  Live Ops is a hybrid role that reports to the Design Department but has heavy overlap in technical, production, and product management. That sound like you?", "link": "https://www.ironfoxgames.com/live-ops-associate"}, {"job": "General Application", "discription": "Don't see a role that fits your skillset? We want to create space for remarkable people that don't fit into any of our listed roles. We are more concerned with finding the right people, and training them. If you have valuable skills and want to join us, reach out!", "link": "https://www.ironfoxgames.com/application-form"}]